public class BublleSort{
	public static void main(String[] args) {
		/*
		冒泡排序:将数组数据按照从小到大的顺序排序;本题数组{24,69,80,57,13}
		思路://括号（*,*）为比较的俩俩数
			1.第一组排序:
			     第1次排序:{ (24,69) ,80,57,13}//括号内符合小的在左,大的在右
			     第2次排序:{24, (69,80) ,57,13}//括号内符合小的在左,大的在右
			     第3次排序:{24,69, (80,57),13} <--交换-->{24,69,57,80,13}
			     第4次排序:{24,69,57, (80,13)} <--交换-->{24,69,57,13,80}
			2.第二组排序:(接着第一组最终结果排序)
			     第1次排序:{(24,69) ,57,13,80}//括号内符合小的在左,大的在右
			     第2次排序:{24,(69,57) ,13,80}<--交换-->{24,57,69,13,80}
			                                 *
			                                 *
			                      共有四组,每组的比较次数都少1；
			                          化繁为简,先死后活
		*/
			int[] arr = {69,24,80,57,13};
			int tmp = 0;
			int len = arr.length;
				for(int j = 0;j < len - 1;j++){//组数的循环,因为每组操作都一样就直接循环带过
							for(int i = 0;i < len - 1 - j;i++){//总共排序四次(i次)
									if(arr[i] > arr[i + 1]){
										tmp = arr[i];
										arr[i] = arr[i + 1];
										arr[i + 1] = tmp;
									}		
							}

							System.out.println("第" + (j+1) + "组排序的最终结果是:");
							for(int i = 0;i < len;i++){
								System.out.print(arr[i] + " ");
							}
							System.out.println("");
				}
					
	
		}
}
