public class Triangle{
	 public static void main(String[] args) {
		/*
		目标:
			1.最终制作一个
					*       
				   * *
				  *   *
				 ******* 
		思路:
			化繁为简:  
			1.制作一个:    
			              ******
						  ******
						  ******
						  ******
			2.制作:
			              *            ----第一行:1个*
			              **		   ----第二行:2个*
			              ***		   ----第三行:3个*
			              ****		   ----第四行:4个*
			              *****		   ----第五行:5个*	
			              			   ----第i行：i个*
			3.制作:
						    *          ----第一行:1个*       ----第一行开头有:4个空格
			               ***		   ----第二行:3个*       ----第二行开头有:3个空格	 
			              *****		   ----第三行:5个*       ----第三行开头有:2个空格
			             *******	   ----第四行:7个*       ----第四行开头有:1个空格
			            *********	   ----第五行:9个*       ----第五行开头有:0个空格
			            			   ----第i行:2i-1个*     ----第i行开头有:(总行数-该行数)个空格
			4.最后(最难):
								*          ----第一行:1个*    *      ----第一行第一个保留* 
							   * *         ----第二行:2个*    * *    ----第二行第一个和最后一个保留*
							  *   *		   ----第三行:2个*    *  *   ----第三行第一个和最后一个保留*
						     *     * 	   ----第四行:2个*    *	 *   ----第si行第一个和最后一个保留*
							*********      ----第五行:9个*    ****** ----第五(最后一行)全部保留*

			先死后活:

		*/
		int totalR = 10;

							for(int row = 1;row <= totalR;row++){//遍历行
									
									//打印空格
									for(int kong = 1;kong <=(totalR-row);kong++){
										System.out.print(" ");
									}
							
		int StarAlocation =(2*row -1);//*的分配方式

							for(int star = 1;star <= StarAlocation;star++){//第几行就分配几个
										//打印*(保留首个和最后一个的*,除了最后一行全部保留)
										//若*是首个位置 || *是最后一个位置 || 行数为最后一行 则打印*
										if(star == 1 || (star == StarAlocation) || row == totalR){
											System.out.print("*");
										}else{
											System.out.print(" ");
										}		
							}

					System.out.println("");//每行*打印完就换行	
				}
	}
}